{
  "headers": {
    "created": "3/10/2025",
    "updated": "3/10/2025",
    "updateHistory": [
      "3/10/2025"
    ],
    "title": "Windows Workgroup",
    "picture": null,
    "author": "Seon Kim",
    "subject": "Personal Experiences"
  },
  "data": [
    {
      "type": "overview",
      "title": null,
      "text": "Windows Workgroup is a convenient feature of Windows Home and other higher versions of Windows for file and folder sharing between devices. That's what I did for my desktop and laptop to allow folder and file sharing. In addition, I implemented security features so that unauthorized access isn't allowed.",
      "note": null,
      "picture": "0.png"
    },
    {
      "type": "small-section",
      "title": "Workgroup assignment",
      "text": "First, I went into System Properties and assigned the system a workgroup called <code>CAG2</code> and gave it a name for easier visibility. This was done on both my desktop and laptop. By doing so, the workgroup was configured after restarting the machines.",
      "note": null,
      "picture": "10.png"
    },
    {
      "type": "small-section",
      "title": "User creation",
      "text": "I created another user so that the devices that need access to the shared folders can do so using this user's credentials. Files can be shared using primary credentials, but that would significantly compromise security if the authorized device is an attacker.",
      "note": null,
      "picture": "11-.png"
    },
    {
      "type": "small-section",
      "title": "Folder sharing",
      "text": "I created a folder, went into the folder properties, and configured it to share with the user I just created. In this case, that user is Public-access.",
      "note": null,
      "picture": "12-SHare.png"
    },
    {
      "type": "small-section",
      "title": "Private Network",
      "text": "I then went into Network Settings and changed the home network I was using to a private network, so that I can transition into a private network while using my home network. I also gave the private network permission to share files and folders and allow for the device to discover and be discovered by others in the same workgroup. This can be done on a public network, but that can compromise security once entering an untrusted network, as a public network is the default. So, by configuring a private network to allow file and folder sharing and discovery, a better security posture is achieved. This was all configured on Windows 11 in the pictures, but a similar procedure was followed on Windows 10.",
      "note": null,
      "multiPicture": true,
      "picture": [
        "18-windows11-2.png",
        "19-windows11.png"
      ]
    },
    {
      "type": "small-section",
      "title": "Testing",
      "text": "I am able to access shared folders by providing the credentials I configured of the username 'Public-access' and the configured password.",
      "note": null,
      "multiPicture": true,
      "picture": [
        "39.png",
        "40.png",
        "111.png"
      ]
    },
    {
      "type": "conclusion",
      "title": null,
      "text": "Before I tried this lab, I was under the assumption that it would be complicated, but after learning about it and configuring it, I came to realize both its simplicity and capability. Before I configured it on my personal devices, I transferred files and folders using a USB stick, but now I'm able to do it using Workgroup, which is much more convenient. Setting some solid security on it also gave me immense comfort, as I initially thought that this would be completely insecure.",
      "note": null,
      "picture": ""
    }
  ]
}