{
  "headers": {
    "created": "3/10/2025",
    "updated": "3/10/2025",
    "updateHistory": [
      "3/10/2025"
    ],
    "title": "Windows Workgroup",
    "picture": null,
    "author": "Seon Kim",
    "subject": "Personal Experiences"
  },
  "data": [
    {
      "type": "overview",
      "title": null,
      "text": "Windows workgroup is a convenient feature of windows home and other higher version of windows for file and folder sharing between devices. That's what I did for my desktop and laptop to allow folder and file sharing. In addition, I implemented security features so that unauthorized access isn't allowed.",
      "note": null,
      "picture": "0.png"
    },
    {
      "type": "small-section",
      "title": "Workgroup assignment",
      "text": "First, I went into system properties and assigned the system a workgroup called <code>CAG2</code> and gave it a name for eaiser visibility. This was done in both my desktop and laptop. By doing so, workgroup was configured after restarting the machines.",
      "note": null,
      "picture": "10.png"
    },
    {
      "type": "small-section",
      "title": "User creation",
      "text": "I created another user so that the devices that needs access to the shared folders can do so using this user credentials. Files can be shared using primary credentials but that will significantly compromise security if the authorized device is an attacker.",
      "note": null,
      "picture": "11-.png"
    },
    {
      "type": "small-section",
      "title": "Folder sharing",
      "text": "I created a folder and went into the folder properties and configured it to share to a user that I just created. In this case that user is Public-access.",
      "note": null,
      "picture": "12-SHare.png"
    },
    {
      "type": "small-section",
      "title": "Private Network",
      "text": "I then went into network settings and changed the home network I was \nusing to private network so that I can transition into a private network\n while using my home network. I also gave private network permission to share files and folders and allow for device to discover and be discovered by others in the same workgroup. This can be done in public network, but that can compromise security once entering a untrusted network as public network is the default set. So by configuring private network to give permissions to file and folder share and discover, better security posture is achieved. This was all configured on windows 11 in the pictures but similar procedure was followed in windows 10.",
      "note": null,
      "multiPicture": true,
      "picture": [
        "18-windows11-2.png",
        "19-windows11.png"
      ]
    },
    {
      "type": "small-section",
      "title": "Testing",
      "text": "I am able to access shared folders by providing the credentials i configured of username of Public-access and configured password.",
      "note": null,
      "multiPicture": true,
      "picture": [
        "39.png",
        "40.png",
        "111.png"
      ]
    },
    {
      "type": "conclusion",
      "title": null,
      "text": "Before I tried this lab, I was under the assumption that it will be complicated, but after learning about it and configuring it I came to realize both its simplicity and capability. Before I configured it on my personal devices, I transferred files and folder using a USB stick, but now I'm able to do it using workgroup which is much more convenient. Setting some solid security on it too gave me immense comfort, as I thought initially, that this will be completely insecure.",
      "note": null,
      "picture": ""
    }
  ]
}