{
  "headers": {
    "created": "2/19/2025",
    "updated": "2/19/2025",
    "updateHistory": [
      "2/19/2025"
    ],
    "title": "CML External Connector Trunk not working",
    "picture": null,
    "author": "Seon Kim",
    "subject": "CML Errors"
  },
  "data": [
    {
      "type": "overview",
      "title": null,
      "text": "Cisco Modeling Labs (CML) was incredibly frustrating as configuring a simple external connector was oddly confusing and had so little documentation. So here is how to configure it and additionally my experience with it. This was done in proxmox.",
      "note": null,
      "picture": ""
    },
    {
      "type": "medium-section",
      "title": "CML Configuration",
      "text": "This is my basic setup in CML and the VM in proxmox is connected to the port.",
      "stepByStepGuide": true,
      "note": null,
      "data": [
        {
          "type": "small-section",
          "title": null,
          "text": "Go to CML cockpit <code>https://&lt;CML-IP&gt;:9090</code>&nbsp; then locate the physically connected network port. Do this by comparing mac address in VM in proxmox and port in CML.",
          "note": null,
          "picture": "7.png"
        },
        {
          "type": "small-section",
          "title": null,
          "text": "Click Add bridge in the networking section. Create the bridge and attach it to the physical port (e.g. ens19 to bridge1)",
          "note": null,
          "picture": "8.png"
        },
        {
          "type": "small-section",
          "title": null,
          "text": "Configure the bridge by clicking on it and setting the IPv4 to disabled and IPv6 to ignore.",
          "note": "This is done so that the bridge doesn't automatically get disabled from failing to configure IP.",
          "picture": "13.png"
        },
        {
          "type": "small-section",
          "title": null,
          "text": "<div>Go to terminal and type become sudo user through <code>sudo -E -s</code> then type in <code>ip link set &lt;bridge&gt; type bridge vlan_filtering 0</code> in order to disable vlan filtering on the bridge.</div><div><br></div><div>e.g. <code>ip link set bridge1 type bridge vlan_filtering 0</code></div>",
          "note": "Disabling vlan filtering will let bridge pass tagged traffic through without untagging them or modifying their vlan.",
          "picture": ""
        },
        {
          "type": "small-section",
          "title": null,
          "text": "Now go to <code>https://&lt;CML-IP&gt;</code> and then navigate to <code>Tools &gt; System Administration &gt; External Connectors</code>. <br>",
          "note": null,
          "picture": "150.png"
        },
        {
          "type": "small-section",
          "title": null,
          "text": "Disable protected for the created bridge and the ping should now work.",
          "note": "This is so that traffic doesn't get unintentionally blocked.",
          "picture": "200.png"
        }
      ],
      "picture": "9.png"
    },
    {
      "type": "medium-section",
      "title": "My Experience",
      "text": "There was a lot of unexpected behavior when protected was configured. ARP requests where coming from both sides when I tried to ping from both sides but the bridge was not allowing them to meet. Cisco had really little documentation that helped me solve this problem so I had to do a lot of searching and troubleshooting and this solution worked.",
      "note": null,
      "picture": "120.png"
    }
  ]
}